src/DataProcessors/МенеджерРолиPowershell.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>МенеджерРолиPowershell</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СвойстваКомпьютеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>СвойстваКомпьютеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКомпьютеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/МенеджерРолиPowershell/Ext/ObjectModule.bsl
// Область для реалиации логики проверки, установки и удаления

#Область ПрикладнойПрограммныйИнтерфейс

Функция ВыполнитьСкрипт(Знач Компьютер, Знач ИмяФайлаСкрипта, Интерактивно = Ложь, ОтИмениСистемы = Ложь) Экспорт 

	ИмяФайлаСкриптаНаАгенте = УдаленноеУправление.ИмяФайлаНаАгенте(ИмяФайлаСкрипта);
	УдаленноеУправление.СкопироватьФайл(Компьютер, ИмяФайлаСкрипта, ИмяФайлаСкриптаНаАгенте);
	Результат = УдаленноеУправление.ВыполнитьКомандуCMD(Компьютер, СтрШаблон("powershell -ExecutionPolicy RemoteSigned %1; exit", ИмяФайлаСкриптаНаАгенте));
	УдаленноеУправление.УдалитьФайл(Компьютер, ИмяФайлаСкриптаНаАгенте);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбщийПрограммныйИнтерфейс

Функция УстановитьРоль(Компьютер) Экспорт 

	//Логика установки роли
	
	Возврат Результат(0);
	
КонецФункции

Функция ПроверитьРоль(Компьютер, ИспользоватьКэш = Истина) Экспорт 

	Попытка
		Результат = ВыполнитьСкрипт(Компьютер, УдаленноеУправление.СоздатьСкрипт("get-host | fl version", ".ps1"));
		РегистрыСведений.СвойстваКомпьютеров.ЗаписатьСвойство(Компьютер, , "Powershell", ?(Результат.КодВозврата = 0, 1, 0), Результат.Лог);
		Возврат Результат.КодВозврата = 0;
		
	Исключение
		Возврат Результат(1, ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат Результат(1, "Не получен ответ от сервера");

КонецФункции

Функция УдалитьРоль(Компьютер) Экспорт

	//Логика удаления роли
	
	Возврат Результат(0);

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

Функция ЭтаРоль()

	Результат = Метаданные().ПолноеИмя();
	Результат = Сред(Результат, СтрНайти(Результат, "МенеджерРоли") + 12);
	Возврат Результат;

КонецФункции

#КонецОбласти
